'use strict';
// Создайте календарь в виде таблицы
// важность: 4
// Напишите функцию createCalendar(elem, year, month).

// Вызов функции должен создать календарь для заданного месяца month в году year
// и вставить его в elem.

// Календарь должен быть таблицей, где неделя – это <tr>, а день – это <td>. У
// таблицы должен быть заголовок с названиями дней недели, каждый день – <th>,
// первым днём недели должен быть понедельник.

// Например, createCalendar(cal, 2012, 9) сгенерирует в cal следующий календарь:
// пн	вт	ср	чт	пт	сб	вс
//                     1	  2
// 3	  4	  5	  6	  7	  8	  9
// 10	11	12	13	14	15	16
// 17	18	19	20	21	22	23
// 24	25	26	27	28	29	30

// P.S. В этой задаче достаточно сгенерировать календарь, кликабельным его делать не нужно.
