'use strict';
// Выведите список потомков в дереве
// важность: 5
// Есть дерево, организованное в виде вложенных списков ul/li.

// Напишите код, который добавит каждому элементу списка <li> количество
// вложенных в него элементов. Узлы нижнего уровня, без детей – пропускайте.

// Результат:
// Животные [9]
//   Млекопитающие [4]
//     Коровы
//     Ослы
//     Собаки
//     Тигры
//   Другие [3]
//     Змеи
//     Птицы
//     Ящерицы
// Рыбы [5]
//   Аквариумные [2]
//     Гуппи
//     Скалярии
//   Морские [1]
//     Морская форель
